echo  █████╗  ██████╗████████╗██╗██╗   ██╗ █████╗ ████████╗ ██████╗ ██████╗ 
echo ██╔══██╗██╔════╝╚══██╔══╝██║██║   ██║██╔══██╗╚══██╔══╝██╔═══██╗██╔══██╗
echo ███████║██║        ██║   ██║██║   ██║███████║   ██║   ██║   ██║██████╔╝
echo ██╔══██║██║        ██║   ██║╚██╗ ██╔╝██╔══██║   ██║   ██║   ██║██╔══██╗
echo ██║  ██║╚██████╗   ██║   ██║ ╚████╔╝ ██║  ██║   ██║   ╚██████╔╝██║  ██║
echo ╚═╝  ╚═╝ ╚═════╝   ╚═╝   ╚═╝  ╚═══╝  ╚═╝  ╚═╝   ╚═╝    ╚═════╝ ╚═╝  ╚═╝  
:ervod
echo [1] Windows 10
echo [2] Windows 11
set /p winselect="Введите пункт: "
if %winselect% EQU 1 (
call "%~dp0\win10.bat"
) 
if %winselect% EQU 2 (
call "%~dp0\win11.bat"
) 
if %winselect% EQU back (
)
echo неверный ввод
goto ervod
                                                   
